package lesson_03;

import java.util.Scanner;

public class ClassWork {
    public static void main(String[] args) {
        /**
         * Операторы сравнения
         ==  Проверяет, равны или нет значения двух операндов, если да,
         то условие становится истинным  (A == B) – не верны

         !=  Проверяет, равны или нет значения двух операндов,
         если значения не равны, то условие становится истинным  (A != B) – значение истинна

         >  Проверяет, является ли значение левого операнда больше,
         чем значение правого операнда, если да, то условие становится истинным  (A > B) – не верны

         <  Проверяет, является ли значение левого операнда меньше,
         чем значение правого операнда, если да, то условие становится истинным  (A < B) – значение истинна

         >=  Проверяет, является ли значение левого операнда больше или равно значению правого операнда,
         если да, то условие становится истинным  (A >= B) – значение не верны

         <=  Проверяет, если значение левого операнда меньше или равно значению правого операнда,
         если да, то условие становится истинным  (A <= B) – значение истинна
         * */

        /**
         Логические операторы

         &&  Называется логический оператор «И». Если оба операнда являются не равны нулю, то условие становится истинным
         ||  Называется логический оператор «ИЛИ». Если любой из двух операндов не равен нулю, то условие становится истинным
         !  Называется логический оператор «НЕ». Использование меняет логическое состояние своего операнда.
         Если условие имеет значение true, то оператор логического «НЕ» будет делать false
         * */

        /**
         if (условие) {
         //действие(-я), которые выполняются, если условие истинно;
         }
         else if (условие) {
         //действие(-я), которые выполняются, если условие истинно;
         }
         else if (условие) {
         //действие(-я), которые выполняются, если условие истинно;
         }
         else {
         //действие(-я), которые выполняются, если условие истинно;
         }*/

         /**

         switch (ВыражениеДляВыбора) {
            case  (Значение1):
                Код1;
                break;
            case (Значение2):
                Код2;
                break;
                ...
            case (ЗначениеN):
                КодN;
                break;
            default:
                КодВыбораПоУмолчанию;
                break;
         }
         * */

         int rate = -1;

//         if (rate == 5) {
//             System.out.println("отл");
//         } else if (rate == 4) {
//             System.out.println("хор");
//         } else if (rate == 3) {
//            System.out.println("удов");
//         } else if (rate == 2) {
//             System.out.println("неудов");
//         } else {
//             System.out.println("лох");
//         }

//         switch (rate) {
//             case (5):
//                 System.out.println("otl");
//                 break;
//             case (4):
//                 System.out.println("hor");
//                 break;
//             case (3):
//                 System.out.println("ydov");
//                 break;
//             case (2):
//                 System.out.println("neydov");
//                 break;
//             default:
//                 System.out.println("konch");
//                 break;
              }




    }



