//package lesson_02;
//
//public class Application {
//    //это точка входа в нашу программу
//    public static void main(String[] args) {
//        //        //типы данных
//        byte a = 10;
//       byte b = 50;
//        int c = a + b;
//        short s = 30000;
//       int i = 1021202112;
//        long l = 12312122121L;
//
//        //Задача 1. Дано 3 строны треуголька: а = 60, и = 45, с=17.
//      //Найти периметр
//        a = 60;
//        b = 45;
//        c = 17;
//
//        int triangle = a + b + c;
//       System.out.println(triangle);
//
//       //задача 2. Дано: Есть числа 10, 3 и метод научного тыка.
//       // Сравнить длину float и double после запято
//
//       double d = 10;
//        double e = 3;
//       float f = (float) (d / e);
//       double n = (double) (d / e);
//
//        System.out.println(f);
//       System.out.println(n);
//
//        //задача 3. Коля получил в школе много двоек и решил закопать свой дневник на 127 метров в глубину
//        //а потом передумал, вернулся и закопал ещё на один метр глубже
//
//        byte deep = 127;
//
//        byte result = (byte) (deep + 1);
//
//        System.out.println(result);
//
//       char ch = 'a';
//
//        System.out.println(ch);
//
//        //Задача 4. Дано: 10 красных и 5 зелёных яблок. Верно ли утверждение,
//        // что красных яблок больше,чем зелёных
//
//        int redApple = 10; // Красное яблоко
//        int greenApple = 5;
//
//        boolean k = redApple > greenApple;
//
//       System.out.println(k);
//
//        //Операторы
///**Арифметические операторы
// + Складывает значения по обе стороны от оператора
// - Вычитает правый операнд из левого операнда
// * Умножает значения по обе стороны от оператора
// / Оператор деления делит левый операнд на правый операнд
// % Делит левый операнд на правый операнд и возвращает остаток
// ++ Инкремент - увеличивает значение операнда на 1 х++ постфиксная, ++х префиксная
// -- Декремент - уменьшает значение операнда на 1 х-- постфиксная, --х префиксная
// */
//
//
//        int a = 10;
//        int b = 3;
//        int res = a % b; //10 = (9 / 3) + 1
//        System.out.println(res);
//
//    }
//}


